---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.InternalException
source: html/b237f597-39f3-64de-9632-08fa2db01f4a.htm
---
# InternalException Members

Retrieves data needed to serialize the target object.